Simple code with ZEROCLOUD:
```
provider "vmc" {
  refresh_token = var.api_token
  org_id        = var.org_id
}

data "vmc_connected_accounts" "my_accounts" {
  account_number = var.aws_account_number
}

data "vmc_customer_subnets" "my_subnets" {
  connected_account_id = data.vmc_connected_accounts.my_accounts.id
  region               = var.sddc_region

}

resource "vmc_sddc" "sddc_1" {
  sddc_name           = var.sddc_name
  vpc_cidr            = var.vpc_cidr
  num_host            = 3
  provider_type       = "ZEROCLOUD"
  region              = data.vmc_customer_subnets.my_subnets.region
  vxlan_subnet        = var.vxlan_subnet
  delay_account_link  = false
  skip_creating_vxlan = false
  sso_domain          = "vmc.local"

  deployment_type = "SingleAZ"

  account_link_sddc_config {
    customer_subnet_ids  = ["subnet-0d10c1a2f8bf72a19"]
    connected_account_id = data.vmc_connected_accounts.my_accounts.id
  }
  timeouts {
    create = "300m"
    update = "300m"
    delete = "180m"
  }
}
```

```
terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vmc_sddc.sddc_1 will be created
  + resource "vmc_sddc" "sddc_1" {
      + availability_zones       = (known after apply)
      + cloud_password           = (known after apply)
      + cloud_username           = (known after apply)
      + cluster_id               = (known after apply)
      + cluster_info             = (known after apply)
      + delay_account_link       = false
      + deployment_type          = "SingleAZ"
      + id                       = (known after apply)
      + intranet_mtu_uplink      = 1500
      + nsxt_cloudadmin          = (known after apply)
      + nsxt_cloudadmin_password = (known after apply)
      + nsxt_cloudaudit          = (known after apply)
      + nsxt_cloudaudit_password = (known after apply)
      + nsxt_private_ip          = (known after apply)
      + nsxt_private_url         = (known after apply)
      + nsxt_reverse_proxy_url   = (known after apply)
      + nsxt_ui                  = (known after apply)
      + num_host                 = 3
      + provider_type            = "ZEROCLOUD"
      + region                   = "us-west-2"
      + sddc_name                = "TF-SDDC"
      + sddc_size                = (known after apply)
      + sddc_state               = (known after apply)
      + size                     = "medium"
      + skip_creating_vxlan      = false
      + sso_domain               = "vmc.local"
      + vc_url                   = (known after apply)
      + vpc_cidr                 = "10.80.0.0/20"
      + vxlan_subnet             = "192.168.1.0/24"

      + account_link_sddc_config {
          + connected_account_id = "93de70dd-8fec-3203-bb04-ba716ffce9c3"
          + customer_subnet_ids  = [
              + "subnet-0d10c1a2f8bf72a19",
            ]
        }

      + timeouts {
          + create = "300m"
          + delete = "180m"
          + update = "300m"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

vmc_sddc.sddc_1: Creating...
vmc_sddc.sddc_1: Still creating... [10s elapsed]
vmc_sddc.sddc_1: Still creating... [20s elapsed]
vmc_sddc.sddc_1: Still creating... [30s elapsed]
vmc_sddc.sddc_1: Still creating... [40s elapsed]
vmc_sddc.sddc_1: Still creating... [50s elapsed]
vmc_sddc.sddc_1: Still creating... [1m0s elapsed]
vmc_sddc.sddc_1: Still creating... [1m10s elapsed]
╷
│ Error: empty non-retryable error received. This is a bug with the Terraform provider and should be reported as a GitHub issue in the provider repository.
│ 
│   with vmc_sddc.sddc_1,
│   on main.tf line 16, in resource "vmc_sddc" "sddc_1":
│   16: resource "vmc_sddc" "sddc_1" {
│ 

```